<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究  )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 文件管理
// +----------------------------------------------------------------------
namespace app\system\controller;


/**
 * 文件管理
 * @author oliver
 *
 */
class Uploader{
	/**
	 * 显示首页面
	 */
	public function uploadImage() {
		
	    // 获取表单上传文件 例如上传了001.jpg
	    $file = request()->file('imgFile');
	    // 移动到框架应用根目录/uploads/ 目录下
	    $info = $file->move( '../uploads');
	    if($info){
	        // 成功上传后 获取上传信息
	        // 输出 jpg
	        echo $info->getExtension();
	        // 输出 20160820/42a79759f284b767dfcb2a0197904287.jpg
	        echo $info->getSaveName();
	        // 输出 42a79759f284b767dfcb2a0197904287.jpg
	        echo $info->getFilename();
	    }else{
	        // 上传失败获取错误信息
	        echo $file->getError();
	    }
	}
}