<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究  )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 订单模型
// +----------------------------------------------------------------------

namespace app\alliance_api\model;

use app\common\model\CommonMod;

class AllianceOrder extends CommonMod{
    public function getOrdertypetextAttr($value,$data){
        $ordertypes = ['groupjoin'=>'加入商友圈','reward'=>'打赏'];
        return $ordertypes[$data['ordertype']];
    }
}