<?php
// +----------------------------------------------------------------------
// | 联盟管理平台
// +----------------------------------------------------------------------
// | Copyright (c) 2017~2020 http://www.qyhzlm.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 商业版权，禁止传播，违者必究  )
// +----------------------------------------------------------------------
// | Author: oliver <2244115959@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 分类信息
// +----------------------------------------------------------------------

namespace app\alliance_api\model;

use app\common\model\CommonMod;

class AllianceCate extends CommonMod{
    
    /**
     * 标签
     * @param unknown $value
     * @param unknown $data
     * @return string
     */
    public function getTagsAttr($value,$data){
        $tagList = explode(' ', $data['tags']) ;
        return $tagList;
    }
}